ИСПП/src/AccumulationRegisters/БракНаСкладах/БракНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БракНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИСПП/src/AccumulationRegisters/БракНаСкладах/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

// Процедура сообщает пользователю об ошибках проведения по регистру ТоварыНаСкладах
//
// Параметры
//	Объект - проводимый документ
//	Отказ - признак отказа от проведения документа
//	РезультатЗапроса - информация об ошибках проведения по регистру
//
Процедура СообщитьОбОшибкахПроведения(Объект, Отказ, РезультатЗапроса) Экспорт
	
	ШаблонСообщенияВНаличииМеньшеНуля = НСтр("ru = 'Номенклатура: %Номенклатура%
	|Недостаточно бракованных МСИ на складе %Склад% на %Количество%'");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Количество < 0 Тогда
			ШаблонСообщения = ШаблонСообщенияВНаличииМеньшеНуля;
			Количество = - Выборка.Количество;
		Иначе
			ВызватьИсключение НСтр("ru = 'Неизвестная ошибка контроля остатков по браку.'");
		КонецЕсли;
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Номенклатура%",
			ОбщегоНазначенияПоддержкаПроектов.ПолучитьПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.СерияНоменклатуры, Выборка.Партия));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(Количество) + " (" + Строка(Выборка.Упаковка) + ")");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%", Строка(Выборка.Склад));// + ?(ЗначениеЗаполнено(Выборка.МестоХранения), ", " + Выборка.МестоХранения, ""));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект,,, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли
